In [2]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],'key2' : ['one', 'two', 'one', 'two', 'one'],'data1' : np.random.randn(5),'data2' : np.random.randn(5)})

In [6]:
df

  key1 key2     data1     data2
0    a  one  1.548668  0.639157
1    a  two -0.713539  2.367475
2    b  one -1.486181 -0.056698
3    b  two  0.150763  0.892212
4    a  one -0.003925 -0.655299

In [7]:
 grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped

In [8]:
grouped.mean()

key1
a    0.277068
b   -0.667709
Name: data1, dtype: float64

In [9]:
 means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [10]:
means

key1  key2
a     one     0.772372
      two    -0.713539
b     one    -1.486181
      two     0.150763
Name: data1, dtype: float64

In [11]:
means.unstack()

key2       one       two
key1
a     0.772372 -0.713539
b    -1.486181  0.150763

In [12]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [17]:
states

array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'], dtype='<U10')

In [14]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [15]:
df['data1'].groupby([states, years]).mean()

California  2005   -0.713539
            2006   -1.486181
Ohio        2005    0.849716
            2006   -0.003925
Name: data1, dtype: float64

In [16]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.277068  0.783778
b    -0.667709  0.417757

In [18]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.772372 -0.008071
     two  -0.713539  2.367475
b    one  -1.486181 -0.056698
     two   0.150763  0.892212

In [19]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  1.548668  0.639157
1    a  two -0.713539  2.367475
4    a  one -0.003925 -0.655299
b
  key1 key2     data1     data2
2    b  one -1.486181 -0.056698
3    b  two  0.150763  0.892212

In [20]:
df['data1'].groupby(df['key1'])
df[['data2']].groupby(df['key1'])

In [21]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.008071
     two   2.367475
b    one  -0.056698
     two   0.892212

In [22]:
people = pd.DataFrame(np.random.randn(5, 5),columns=['a', 'b', 'c', 'd', 'e'],index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [23]:
people

               a         b         c         d         e
Joe    -1.714879 -1.040573 -0.883118  0.358432 -1.049576
Steve   0.110974  0.828397 -0.287081 -1.309180 -0.602741
Wes     0.420356 -0.393838 -0.038516 -0.979668 -0.187221
Jim    -0.242956 -0.381786 -0.112322  0.646514 -0.753189
Travis -1.182785 -1.711481 -1.750203 -0.700555  0.694388

In [24]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [25]:
 by_column = people.groupby(mapping, axis=1)

In [26]:
by_column

In [27]:
by_column.sum()

            blue       red
Joe    -0.524686 -3.805028
Steve  -1.596261  0.336629
Wes    -1.018184 -0.160702
Jim     0.534192 -1.377931
Travis -2.450758 -2.199878

In [29]:
map_series = pd.Series(mapping)
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        2    3
Jim        2    3
Travis     2    3

In [30]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [31]:
df

  key1 key2     data1     data2
0    a  one  1.548668  0.639157
1    a  two -0.713539  2.367475
2    b  one -1.486181 -0.056698
3    b  two  0.150763  0.892212
4    a  one -0.003925 -0.655299

In [32]:
grouped = df.groupby('key1')

In [33]:
grouped

In [34]:
grouped['data1'].quantile(0.9)

key1
a    1.238149
b   -0.012931
Name: data1, dtype: float64

In [36]:
grouped['data1'].mean()

key1
a    0.277068
b   -0.667709
Name: data1, dtype: float64

In [37]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.277068  1.156984 -0.713539 -0.358732 -0.003925  0.772372
b      2.0 -0.667709  1.157494 -1.486181 -1.076945 -0.667709 -0.258473

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.548668   3.0  0.783778  1.516568 -0.655299 -0.008071  0.639157
b     0.150763   2.0  0.417757  0.670981 -0.056698  0.180530  0.417757


           75%       max
key1
a     1.503316  2.367475
b     0.654985  0.892212

In [38]:
tips = pd.read_csv('tips.csv')

In [39]:
tips

     total_bill   tip smoker   day    time  size
0         16.99  1.01     No   Sun  Dinner     2
1         10.34  1.66     No   Sun  Dinner     3
2         21.01  3.50     No   Sun  Dinner     3
3         23.68  3.31     No   Sun  Dinner     2
4         24.59  3.61     No   Sun  Dinner     4
..          ...   ...    ...   ...     ...   ...
239       29.03  5.92     No   Sat  Dinner     3
240       27.18  2.00    Yes   Sat  Dinner     2
241       22.67  2.00    Yes   Sat  Dinner     2
242       17.82  1.75     No   Sat  Dinner     2
243       18.78  3.00     No  Thur  Dinner     2

[244 rows x 6 columns]

In [40]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [41]:
tips['tip_pct']

0      0.059447
1      0.160542
2      0.166587
3      0.139780
4      0.146808
         ...
239    0.203927
240    0.073584
241    0.088222
242    0.098204
243    0.159744
Name: tip_pct, Length: 244, dtype: float64

In [42]:
 grouped = tips.groupby(['day', 'smoker'])

In [43]:
grouped

In [44]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [46]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [47]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [48]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345